#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Constructor_FeelTheBase_DeathListener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_GenericTriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Constructor_FeelTheBase_DeathListener.GA_Constructor_FeelTheBase_DeathListener_C
// 0x0040 (0x0A60 - 0x0A20)
class UGA_Constructor_FeelTheBase_DeathListener_C final : public UGAT_GenericTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Constructor_FeelTheBase_DeathListener_C; // 0x0A20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 StackCount;                                        // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  OverflowTag;                                       // 0x0A30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Stack1;                                            // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack2;                                            // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack3;                                            // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Constructor_FeelTheBase_DeathListener(int32 EntryPoint);
	void Exceute_GC(class AB_Constructor_BASE_C* BaseReference, bool* Overflow);
	void ActivateBaseStacks(int32 StackCount_0, class AB_Constructor_BASE_C* BaseReference);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Constructor_FeelTheBase_DeathListener_C">();
	}
	static class UGA_Constructor_FeelTheBase_DeathListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Constructor_FeelTheBase_DeathListener_C>();
	}
};

}

