#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GCNL_Creative_BarrelExplosion_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Creative_BarrelExplosion_Player.GCNL_Creative_BarrelExplosion_Player_C
// 0x0020 (0x07B0 - 0x0790)
class AGCNL_Creative_BarrelExplosion_Player_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PPTL_Float_8E9D15DC4EF390F8C03558BDF1F0ABE0;       // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PPTL__Direction_8E9D15DC4EF390F8C03558BDF1F0ABE0;  // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A5[0x3];                                      // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     PPTL;                                              // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Creative_BarrelExplosion_Player(int32 EntryPoint);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void PPTL__FinishedFunc();
	void PPTL__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Creative_BarrelExplosion_Player_C">();
	}
	static class AGCNL_Creative_BarrelExplosion_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Creative_BarrelExplosion_Player_C>();
	}
};

}

