#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HeroLoadoutItemPedestal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HeroLoadoutItemPedestal.HeroLoadoutItemPedestal_C
// 0x00B8 (0x03E0 - 0x0328)
class AHeroLoadoutItemPedestal_C final : public AFortHeroLoadoutPedestal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      AnimationTagQuery_Idle;                            // 0x0338(0x0048)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FTransform                             CommandScreenTransform;                            // 0x0380(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             HeroLoadoutScreenTransform;                        // 0x03B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeroLoadoutItemPedestal(int32 EntryPoint);
	void HandleSlotFocusInUIChanged();
	void OnHeroPawnSetupCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroLoadoutItemPedestal_C">();
	}
	static class AHeroLoadoutItemPedestal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHeroLoadoutItemPedestal_C>();
	}
};

}

