#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemInspectScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectScreen.ItemInspectScreen_C
// 0x0190 (0x06B8 - 0x0528)
class UItemInspectScreen_C final : public UFortItemInspectionScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           AbilitiesPerksAndAlterationsBox;                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                CameraFrameSpacer;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   ExtraDetailsPanelTabList;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ExtraDetailsTabContentSwitcher;                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeroLoadoutActiveAbilitiesDetailWidget_C* HeroLoadoutActiveAbilitiesDetailWidget;         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeroLoadoutPerksDetailWidget_C*        HeroLoadoutPerksDetailWidget;                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           HeroPerkTabContentBox;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ItemActionSwitcher;                                // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemAlterationsListDetailWidget_C*     ItemAlterationsListDetailWidget;                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCraftingIngredientsDetailWidget_C* ItemCraftingIngredientsDetailWidget;               // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDescriptionDetailWidget_C*         ItemDescriptionDetailWidget;                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectEvolutionConfirmation_C*    ItemInspectEvolutionConfirmation;                  // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectEvolveRarityConfirmation_C* ItemInspectEvolveRarityConfirmation;               // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectUpgradeCallout_C*           ItemInspectUpgradeCallout;                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectUpgradeConfirmation_C*      ItemInspectUpgradeConfirmation;                    // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemPerksListDetailWidget_C*           ItemPerksListDetailWidget;                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectionMainItemDetailsHostPanel_C* MainDetailsPanel;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxDetails;                                  // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Upgrades;                                  // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USupportHeroSquadBonusesDetailWidget_C* SupportHeroSquadBonusesDetailWidget;               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USurvivorTraitsDetailWidget_C*          SurvivorTraitsDetailWidget;                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectionItemExtraDetailsHostPanel_C* TabbedExtraDetailsPanel;                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PreviewLabel;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWindowTitleBarArea*                    WindowTitleBar;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              SelectedEvolutionItem;                             // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectUpgradePopupMenu_C*         UpgradePopupMenu;                                  // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectAlterationModScreen_C*      AlterationModScreen;                               // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FGameplayTag> RequiredTags;                                     // 0x0608(0x0050)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	bool                                          DoOnceFlagUpgradeHint;                             // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasShownUpgradeTutorialCallout;                    // 0x0659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A[0x6];                                      // 0x065A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UItemInspectRefundPopupMenu_C*          RefundPopupMenu;                                   // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CelebrateFXCheckHandle;                            // 0x0668(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      AnimationTagQuery_Idle;                            // 0x0670(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ItemInspectScreen(int32 EntryPoint);
	void CheckIfCelebrateFXIsComplete();
	void OnRefundItemConfirmed(class UFortAccountItem* ItemToRefund);
	void HandleRefundItem();
	void ShowRefundHelp();
	void OnRemovedFromActivationStack();
	void Construct();
	void BndEvt__ItemInspectUpgradeConfirmation_K2Node_ComponentBoundEvent_0_OnUpgradeConfirm__DelegateSignature();
	void BndEvt__ItemInspectUpgradeConfirmation_K2Node_ComponentBoundEvent_1_OnUpgradeCancel__DelegateSignature();
	void HandleItemToInspectDestroyedBP();
	void HandleItemToInspectChangedBP();
	void HandleDifferentInspectionModeSetBP();
	void HandleDifferentItemToInspectSetBP();
	void HandleIsPreviewingChanged();
	void BndEvt__ItemInspectEvolutionConfirmation_K2Node_ComponentBoundEvent_4_OnEvolutionConfirm__DelegateSignature(class UFortItem* ItemToEvolve, int32 EvolutionIndex);
	void BndEvt__ItemInspectEvolveRarityConfirmation_K2Node_ComponentBoundEvent_2_OnEvolutionOptionSelected__DelegateSignature(class UFortItem* Item, int32 RecipeIndex);
	void BndEvt__ItemInspectEvolveRarityConfirmation_K2Node_ComponentBoundEvent_34_OnEvolutionConfirm__DelegateSignature();
	void OnInputModeChanged(bool bUsingGamepad);
	void BndEvt__DetailPanelTabList_PC_K2Node_ComponentBoundEvent_385_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void OnDeactivated();
	void Destruct();
	void OnActivated();
	void BndEvt__ItemInspectUpgradeCallout_K2Node_ComponentBoundEvent_444_OnRequestUpgrade__DelegateSignature();
	void BndEvt__ItemInspectEvolutionConfirmation_K2Node_ComponentBoundEvent_2_OnEvolutionOptionSelected__DelegateSignature(class UFortItem* Item, int32 RecipeIndex);
	void DialogResult_3D444D7245BFED3F760CE49A5698A308(EFortDialogResult Result, class FName ResultName);
	void DialogResult_7EB32ED049ED082854D5738A81CFCAA2(EFortDialogResult Result, class FName ResultName);
	void OnMCPRequestComplete_5E880EAB4E8645A0B59BA29917400203();
	void HandleBack(bool* PassThrough);
	void HandleFavorite(bool* PassThrough);
	void HandleView(bool* PassThrough);
	void HandleEvolution();
	void HandleUpgrade();
	void HandleEvolutionChoiceHovered(class UFortItem* Item);
	void HandleEvolutionChoiceUnhovered(class UFortItem* Item);
	void HandleEvolutionChoiceSelected(class UFortItem* Item, int32 RecipeIndex);
	void GetFirstEvolutionOption(class UFortItem** EvolutionItem);
	void SetupActionHandlers();
	void ResetDetailsPanel();
	void HandleCursorModeChanging(bool IsEnabled);
	void RefreshOnUpgrade();
	void HandleEvolutionComplete(bool bWasSuccessful, const class FString& OriginalItemInstanceId, TArray<struct FFortItemInstanceQuantityPair>& ResultingItems);
	void RefreshActionHandlers();
	void RefreshCallout();
	void ShowPreviewHeader(bool ShowPreviewLabel);
	void SetTabButtonStyle(class UObject* Object);
	void SetInspectModeForChildPanels(EFortItemInspectionMode NewInspectMode);
	void OnItemCycleChangedItem(class UFortItem* NewItemToRepresent);
	void RefreshExtraDetailsTabs();
	void HandleUpgradeItemRarity();
	void SetAllInputActionStates(EInputActionState InputActionState);
	EInputActionState GetViewInputState();
	ESlateVisibility GetEvolutionVisibility();
	EInputActionState GetFavoriteInputState();
	ESlateVisibility GetUpgradeRarityVisibility();
	void Setup_Evolution_Selection_for_Comparisons(class UFortItem* Item, int32 RecipeIndex);
	void RefreshItemViewHandlerStates();
	class UWidget* GetWidgetForFramingViewedItem();
	void BindDelegates();
	void UnbindDelegates();
	ESlateVisibility GetWindowTitleBarVisibility();
	void UpdateInspectionMode();
	void HandleSchematicUpgradeOptions(bool* bPassThrough);
	void GetLevelUpVisibility(ESlateVisibility* Return_Value);
	void SetOverviewActionsInputState(EInputActionState State);
	void GetAlterationModifyVisibility(ESlateVisibility* Return_Value);
	void GetUpgradeItemInputActionState(EInputActionState* Return_Value);
	void GetItemActionSwitcherVisibility(ESlateVisibility* Return_Value);
	void HandleAlterationModify();
	void CreateUpgradePopupMenu();
	bool IsAlterableItem();
	bool MeetsQuestRequirements();
	bool SchematicRequirementsMet();
	void GetRequiredTagContainer(class UFortItemDefinition* ItemDef, bool* HasRequiredTag, struct FGameplayTagContainer* RequiredTagContainer);
	void SetupScrollWidget();
	void SetupUpgrades();
	void UpgradeQuestComplete(bool* QuestIsComplete);
	void AlterationQuestComplete(bool* QuestComplete);
	void CheckForSideTutorialQuests(bool* RelevantSideQuestFound);
	void HandleShowUpgradeTutorial();
	void HandleRefundPopup(bool* bPassThrough);
	void CreateRefundPopupMenu();
	void ShowRefundHelpIfNecessary();
	void GetRefundPopupInputActionState(EInputActionState* State);
	void ShowRefundConfirmationModalWidget();
	void ShouldShowRefundMessage(bool* ShouldShowRefundMessage_0, class FText* RefundDescriptionText);
	void GetRefundHelpActions(TArray<struct FConfirmationDialogAction>* ConfirmActions, class FName* DeclineAction);
	void HandleVaultItemsViewed(TArray<class UFortItem*>& Items);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectScreen_C">();
	}
	static class UItemInspectScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectScreen_C>();
	}
};

}

