#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LTMFerretVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FerretVehicle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LTMFerretVehicle.LTMFerretVehicle_C
// 0x0050 (0x19F0 - 0x19A0)
class ALTMFerretVehicle_C final : public AFerretVehicle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_LTMFerretVehicle_C;                 // 0x1998(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Music;                                             // 0x19A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Left;                                              // 0x19A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Right;                                             // 0x19B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 StormEffectGE;                                     // 0x19B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortNiagaraCascadeSystemPair          SpawnFX;                                           // 0x19C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           LandedTimer;                                       // 0x19D0(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         OnGroundCount;                                     // 0x19D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19DC[0x4];                                     // 0x19DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UParticleSystemComponent*               GunEffects;                                        // 0x19E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LTMFerretVehicle(int32 EntryPoint);
	void Check_If_On_Ground_and_Slow();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void Start_Music();
	void SetGrantWeaponGE(TSubclassOf<class UGameplayEffect> NewGE);
	void HideQuickBarForAbility(bool Hide);
	void OnLanding();
	void OnPawnEnterVehicle(class AFortPlayerPawn* PlayerPawn, int32 SeatIdx);
	void OnPawnExitVehicle(class AFortPlayerPawn* PlayerPawn, class FName ExitSocketName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LTMFerretVehicle_C">();
	}
	static class ALTMFerretVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALTMFerretVehicle_C>();
	}
};

}

