#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PickupItemListComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PickupItemListComponent.PickupItemListComponent_C
// 0x0068 (0x0140 - 0x00D8)
class UPickupItemListComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AFortPickupAthena*>              ItemsToBeAddedQueue;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class UFortWorldItemDefinition*>       ItemList;                                          // 0x00F0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, RepNotify)
	struct FTimerHandle                           AddItemsTimerHandle;                               // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AddItemsTimeout;                                   // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FMinigameSpawnerSpawnParams>    ItemsToSpawn;                                      // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame)
	TMulticastInlineDelegate<void(class AActor* ItemAdded)> OnItemAdded;                             // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnItemListUpdated;                                 // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_PickupItemListComponent(int32 EntryPoint);
	void PreSaveBaseActorRecord();
	void PreFinishSpawning(class AFortVolume* VolumeSpawnedWithin);
	void PostLevelSaveSpawnCleanup();
	void PostFinishSpawning();
	void AddItemToQueue(class AFortPickupAthena* NewItem, bool* bItemAdded);
	void CanInteractWithOwner(class AFortPawn* InteractingPawn, bool* bCanInteract);
	void AddItemsToList();
	void IsItemInList(class UFortWorldItemDefinition* ItemDefinition, bool* bInList);
	void ClearItemList();
	void OnRep_ItemList();
	void IsItemInQueue(class AFortPickupAthena* NewItem, bool* bInQueue);

	bool CanBeSavedToCreativeVolume() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickupItemListComponent_C">();
	}
	static class UPickupItemListComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickupItemListComponent_C>();
	}
};

}

