#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PlayerSurveyPanelAnswerSelectorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelAnswerSelectorWidget.PlayerSurveyPanelAnswerSelectorWidget_C
// 0x00C8 (0x0308 - 0x0240)
class UPlayerSurveyPanelAnswerSelectorWidget_C final : public UFortPlayerSurveyQuestionDisplayWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                EmptyWidget;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyPanelContentsAnswerRatingWidget_C* PlayerSurveyPanelContentsAnswerRatingWidget; // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EFortPlayerSurveyQuestionType, class UClass*> SwitcherTable;                                // 0x0260(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EFortPlayerSurveyQuestionType, class UFortPlayerSurveyAnswerWidgetBase*> SwitcherWidgets;   // 0x02B0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortPlayerSurveyAnswerWidgetBase*      CurrentChild;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveyPanelAnswerSelectorWidget(int32 EntryPoint);
	void HandleQuestionChanged();
	void OnInitialized();
	void Construct();
	void InitSwitcherChildren();
	void UpdateCurrentChild();
	void SetCurrentChild(class UFortPlayerSurveyAnswerWidgetBase* Widget);
	void GetDefaultFocusedWidget(class UWidget** Result);
	void CommitCurrentAnswer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelAnswerSelectorWidget_C">();
	}
	static class UPlayerSurveyPanelAnswerSelectorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelAnswerSelectorWidget_C>();
	}
};

}

